import Container from "@/components/Common/Container";

export default function TermsPage() {
  return (
    <Container className="flex flex-col gap-5">
      <h1 className="text-3xl font-bold">قوانین و مقررات</h1>
      <div className="bg-white rounded-primary p-6">
        <h2 className="text-xl font-bold mb-2">قوانین عمومی</h2>
        <ul className="list-disc pr-6 flex flex-col gap-1 text-lg">
          <li>ریموتجو بستری برای ارتباط میان شرکت‌ها و کارجویان است.</li>
          <li>
            کلیه اقدامات و عملکرد ریموتجو مطابق با قوانین و مقررات جاری جمهوری
            اسلامی ایران، اعم از قانون اساسی، قانون مدنی، قانون تجارت الکترونیک
            و قانون حمایت از حقوق مصرف‌کننده است.
          </li>
          <li>
            با استفاده از ریموتجو، شما می‌پذیرید که به هرگونه تغییر و
            به‌روزرسانی در قوانین و مقررات موافقت کرده‌اید.
          </li>
          <li>
            استفاده از خدمات به معنای آگاهی، پذیرش و التزام به شرایط و تعهدات
            این توافقنامه می‌باشد.
          </li>
        </ul>
      </div>
      <div className="bg-white rounded-primary p-6">
        <h2 className="text-xl font-bold mb-2">
          تعهدات سایت در قبال اطلاعات کاربران
        </h2>
        <ul className="list-disc pr-6 flex flex-col gap-1 text-lg">
          <li>
            ماموریت ریموتجو، ارتباط بین کارجویان و شرکت‌ها برای پیدا کردن
            فرصت‌های شغلی و نیروی کار مناسب است.
          </li>
          <li>
            ریموتجو ملزم به رعایت حریم شخصی کاربران و حفظ اطلاعات آنها است.
          </li>
          <li>
            ریوتجو نیز مانند سایر وب‌سایت‌ها اطلاعات مرتبط با IP و کوکی را به
            منظور اهداف امنیتی و مدیریت سایت جمع‌آوری می‌نماید.
          </li>
        </ul>
      </div>
      <div className="bg-white rounded-primary p-6">
        <h2 className="text-xl font-bold mb-2">شرایط انتشار آگهی</h2>
        <ul className="list-disc pr-6 flex flex-col gap-1 text-lg">
          <li>آگهی‌ها برای یک عنوان شغلی به مدت ٣۰ روز منتشر می‌شوند.</li>
          <li>
            ریموتجو مختار است تمامی پیام‌ها، آگهی‌ها، تصاویر و اطلاعات ارسالی
            کاربران را بررسی، ویرایش یا حذف نماید.
          </li>
        </ul>
      </div>
      <div className="bg-white rounded-primary p-6">
        <h2 className="text-xl font-bold mb-2">موارد رفع مسئولیت از سایت</h2>
        <ul className="list-disc pr-6 flex flex-col gap-1 text-lg">
          <li>ریموتجو مسئولیتی در قبال مطالب ارسالی توسط کاربران ندارد.</li>
          <li>هر گونه توافق یا تعهد بین کارجو و شرکت بر عهده آن دو طرف است.</li>
          <li>
            استفاده از هرگونه متن، پیام، توضیح، اطلاعات و عکس‌ها بر عهده فرستنده
            است.
          </li>
          <li>
            ریموتجو هیچ تضمینی در مورد نتیجه استخدام یا انتخاب نیرو ندارد.
          </li>
        </ul>
      </div>
      <div className="bg-white rounded-primary p-6">
        <h2 className="text-xl font-bold mb-2">
          دریافت اطلاعات از سایت‌های دیگر
        </h2>
        <ul className="list-disc pr-6 flex flex-col gap-1 text-lg">
          <li>
            ریموتجو به منظور تجمیع همه فرصت‌های شغلی از سایت‌های معتبر کاریابی
            در سراسر ایران اطلاعاتی را جمع‌آوری می‌کند. به این منظور، ممکن است
            اطلاعات و فرصت‌های شغلی از سایت‌هایی مانند جابینجا، جاب‌ویژن و
            ای‌استخدام استخراج شود.
          </li>
          <li>
            ریموتجو هیچ گونه مسئولیتی در قبال محتوای منتشر شده در آگهی‌های
            سایت‌های کاریابی ندارد و تنها نمایش‌دهنده موقعیت‌های شغلی آن‌ها
            می‌باشد.
          </li>
          <li>
            ممکن است در ریموتجو لینک‌هایی به وبسایت‌ها یا خدمات دیگر وچود داشته
            باشد. هرگونه استفاده از این لینک‌ها خارج از برنامه ما، تحت مسئولیت
            شما قرار می‌گیرد
          </li>
        </ul>
      </div>
    </Container>
  );
}
