import React from "react";
import Container from "../Common/Container";
import Accordion from "../Common/Accordion";

interface Props {}

const faqsData = [
  {
    title: "ریموتجو چیست؟",
    desc: "ریموتجو یک پلتفرم است که شغل‌های از راه دور را از وبسایت‌های مختلف شغلی جمع‌آوری کرده و آن‌ها را در یک مکان مرکزی نمایش می‌دهد. هدف این وبسایت، ارائه یک روش ساده و کارآمد برای کاوش فرصت‌های شغلی از راه دور به کاربران است. علاوه بر این، امکانی برای کارفرمایان فراهم می‌کنیم تا شغل‌های از راه دور خود را مستقیماً در ریموتجو منتشر کنند.",
  },
  {
    title: "آیا آگهی‌های شغلی در وبسایت شما به‌روز هستند؟",
    desc: "بله. درواقع ما تنها جدیدترین آگهی های شغلی را جمع آوری می کنیم.",
  },
  {
    title: "آیا تمام آگهی‌های شغلی, شغل‌های از راه دور هستند؟",
    desc: "بله، ریموتجو به طور انحصاری بر روی آگهی‌های شغلی از راه دور تمرکز دارد. ما تنها آگهی‌های شغلی که ریموت هستند، تهیه و گردآوری می‌کنیم.",
  },
  {
    title: "آیا می توان توسط ریموتجو به تمامی آگهی ها رزومه ارسال کرد؟",
    desc: "خیر. ارسال رزومه از طریق ریموتجو تنها برای آگهی هایی که در ریموتجو ایجاد شده اند, امکان پذیر است. ما فقط آگهی های دورکاری که در وبسایت های شغل یابی منتشر شده را استخراج و به نمایش می گذاریم.",
  },
  {
    title: "آیا استفاده از وبسایت شما هزینه‌ای دارد؟",
    desc: "خیر، استفاده از ریموتجو برای کارجویان و کارفرمایان رایگان است. هدف ما ارائه یک پلتفرم رایگان و مفید برای جمع‌آوری و نمایش شغل‌های از راه دور است. هیچ هزینه‌ای بابت استفاده از ریموتجو یا درج آگهی شغلی نیاز نیست.",
  },
];

const FAQ = ({}: Props) => {
  return (
    <Container className="flex flex-col md:flex-row gap-6">
      <h2 className="text-4xl lg:text-6xl text-transparent bg-clip-text bg-main font-semibold flex-[1]">
        سوالات متداول درباره ریموتجو
      </h2>
      <div className="flex flex-col gap-4 flex-[5]">
        {faqsData.map((faq, i) => (
          <Accordion key={i} {...faq} />
        ))}
      </div>
    </Container>
  );
};

export default FAQ;
